app/Controllers/admin/User.php

   public function User_table(){
    $data['page_title'] = "User List";
    $all  =  $this->usermodel->findAll();
---
SELECT *
FROM `user`