app/Helpers/main_helper.php

SELECT *
FROM `setting`
WHERE `id` = 1
---
function getAppDetails($rows ,$filds){
 $model = db_connect();
    if($filds === null){
        return "null";
    }
  $row = $model->table('setting')->where("id",$rows)->get()->getResult("array");

SELECT *
FROM `user`
WHERE `email` = 'madhav@gmail.com'
SELECT *
FROM `user_permission`
WHERE `user` = '1'
---
function get_Permission($email , $password){
    $db = db_connect();

   if($email && $password == null){
      return throw new Exception("User Permission not found Wrong email and Password");
   }
   // fetching user info
   $row = $db->table("user")->where("email",$email)->get()->getResultArray();
   // if password match
   if($row && password_verify($password ,$row[0]['password'])){

   $user_persmisson =  $db->table("user_permission")->where("user",$row[0]['id'])->get()->getResult("array");