app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `email` = 'madhav@gmail.com'
 LIMIT 1
---
    public function get_login()
    {
        $email = (string) $this->request->getPost('email');
        $password = (string) $this->request->getPost('password');
        $remember_me = $this->request->getPost('remember_me');

        $this->validation->setRules([
            'email' => 'required|valid_email',
            'password' => 'required'
        ]);

        if (!$this->validate($this->validation->getRules())) {
            return view('login', ['validation' => $this->validator]);
        }

        $userModel = new UserModel();
        $user = $userModel->where("email", $email)->first();